; domain
(define (domain Storage-Propositional)
    (:requirements :typing)
    (:types
        hoist crate place area - object
        container depot - place
        storearea transitarea - area
    )

    (:predicates
        (clear ?s - storearea)
        (in ?x -
            (either storearea crate) ?p - place)
        (available ?h - hoist)
        (lifting ?h - hoist ?c - crate)
        (at ?h - hoist ?a - area)
        (on ?c - crate ?s - storearea)
        (connected ?a1 ?a2 - area)
        (compatible ?c1 ?c2 - crate)
    )

    (:action lift
        :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
        :precondition (and
            (connected ?a1 ?a2)
            (at ?h ?a2)
            (available ?h)
            (on ?c ?a1)
            (in ?a1 ?p))
        :effect (and
            (not (on ?c ?a1))
            (clear ?a1)
            (not (available ?h))
            (lifting ?h ?c)
            (not (in ?c ?p)))
    )

    (:action drop
        :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
        :precondition (and
            (connected ?a1 ?a2)
            (at ?h ?a2)
            ( lifting ?h ?c)
            (clear ?a1)
            (in ?a1 ?p))
        :effect (and
            (not (lifting ?h ?c))
            (available ?h)
            (not (clear ?a1))
            (on ?c ?a1)
            (in ?c ?p))
    )

    (:action move
        :parameters (?h - hoist ?from ?to - storearea)
        :precondition (and
            (at ?h ?from)
            (clear ?to)
            (connected ?from ?to))
        :effect (and
            (not (at ?h ?from))
            (at ?h ?to)
            (not (clear ?to))
            (clear ?from))
    )

    (:action go-out
        :parameters (?h - hoist ?from - storearea ?to - transitarea)
        :precondition (and
            (at ?h ?from)
            (connected ?from ?to))
        :effect (and
            (not (at ?h ?from))
            (at ?h ?to)
            (clear ?from))
    )

    (:action go-in
        :parameters (?h - hoist ?from - transitarea ?to - storearea)
        :precondition (and
            (at ?h ?from)
            (connected ?from ?to)
            (clear ?to))
        :effect (and
            (not (at ?h ?from))
            (at ?h ?to)
            (not (clear ?to)))
    )
)

; problem
(define (problem storage-101)
	(:domain Storage-Propositional)
	(:objects
		depot48-1-1 depot49-1-1 depot50-1-1 depot50-1-2 depot50-1-3 container-0-0 container-0-1 container-0-2 container-0-3 - storearea
		hoist0 - hoist
		crate0 crate1 crate2 crate3 - crate
		container0 - container
		depot48 depot49 depot50 - depot
		loadarea - transitarea
	)
	(:init
		(connected depot50-1-1 depot50-1-2)
		(connected depot50-1-2 depot50-1-3)
		(connected depot50-1-2 depot50-1-1)
		(connected depot50-1-3 depot50-1-2)
		(in depot48-1-1 depot48)
		(in depot49-1-1 depot49)
		(in depot50-1-1 depot50)
		(in depot50-1-2 depot50)
		(in depot50-1-3 depot50)
		(on crate0 container-0-0)
		(on crate1 container-0-1)
		(on crate2 container-0-2)
		(on crate3 container-0-3)
		(in crate0 container0)
		(in crate1 container0)
		(in crate2 container0)
		(in crate3 container0)
		(in container-0-0 container0)
		(in container-0-1 container0)
		(in container-0-2 container0)
		(in container-0-3 container0)
		(connected loadarea container-0-0)
		(connected container-0-0 loadarea)
		(connected loadarea container-0-1)
		(connected container-0-1 loadarea)
		(connected loadarea container-0-2)
		(connected container-0-2 loadarea)
		(connected loadarea container-0-3)
		(connected container-0-3 loadarea)
		(connected depot48-1-1 loadarea)
		(connected loadarea depot48-1-1)
		(connected depot49-1-1 loadarea)
		(connected loadarea depot49-1-1)
		(connected depot50-1-1 loadarea)
		(connected loadarea depot50-1-1)
		(clear depot48-1-1)
		(clear depot50-1-1)
		(clear depot50-1-2)
		(clear depot50-1-3)
		(at hoist0 depot49-1-1)
		(available hoist0)
	)
	(:goal
		(and
			(in crate0 depot48)
			(in crate1 depot49)
			(in crate2 depot50)
			(in crate3 depot50)
        )
	)
)

; plan
1. (go-out hoist0 depot49-1-1 loadarea)
   deleted: (at hoist0 depot49-1-1)
   added: (at hoist0 loadarea) (clear depot49-1-1)
   goals met: 0 of 4
2. (lift hoist0 crate0 container-0-0 loadarea container0)
   deleted: (on crate0 container-0-0) (available hoist0) (in crate0 container0)
   added: (clear container-0-0) (lifting hoist0 crate0)
   goals met: 0 of 4
3. (drop hoist0 crate0 depot48-1-1 loadarea depot48)
   deleted: (lifting hoist0 crate0) (clear depot48-1-1)
   added: (available hoist0) (on crate0 depot48-1-1) (in crate0 depot48)
   goals met: 1 of 4
4. (lift hoist0 crate1 container-0-1 loadarea container0)
   deleted: (on crate1 container-0-1) (available hoist0) (in crate1 container0)
   added: (clear container-0-1) (lifting hoist0 crate1)
   goals met: 1 of 4
5. (drop hoist0 crate1 depot49-1-1 loadarea depot49)
   deleted: (lifting hoist0 crate1) (clear depot49-1-1)
   added: (available hoist0) (on crate1 depot49-1-1) (in crate1 depot49)
   goals met: 2 of 4
6. (lift hoist0 crate3 container-0-3 loadarea container0)
   deleted: (on crate3 container-0-3) (available hoist0) (in crate3 container0)
   added: (clear container-0-3) (lifting hoist0 crate3)
   goals met: 2 of 4
7. (go-in hoist0 loadarea depot50-1-1)
   deleted: (at hoist0 loadarea) (clear depot50-1-1)
   added: (at hoist0 depot50-1-1)
   goals met: 2 of 4
8. (drop hoist0 crate3 depot50-1-2 depot50-1-1 depot50)
   deleted: (lifting hoist0 crate3) (clear depot50-1-2)
   added: (available hoist0) (on crate3 depot50-1-2) (in crate3 depot50)
   goals met: 3 of 4
9. (go-out hoist0 depot50-1-1 loadarea)
   deleted: (at hoist0 depot50-1-1)
   added: (at hoist0 loadarea) (clear depot50-1-1)
   goals met: 3 of 4
10. (lift hoist0 crate2 container-0-2 loadarea container0)
   deleted: (on crate2 container-0-2) (available hoist0) (in crate2 container0)
   added: (clear container-0-2) (lifting hoist0 crate2)
   goals met: 3 of 4
11. (drop hoist0 crate2 depot50-1-1 loadarea depot50)
   deleted: (lifting hoist0 crate2) (clear depot50-1-1)
   added: (available hoist0) (on crate2 depot50-1-1) (in crate2 depot50)
   goals met: 4 of 4
